app/Controllers/Admin/MenuController.php

INSERT INTO `menu` (`label_menu`, `url_menu`, `content_id`, `content_type`, `parent_id`, `has_child`) VALUES ('About Us', 'about-us', 15, 1, 0, 0)
---
    private function save_menu_item( $item, $parent_id )
 {
        $label = $item['label'];
        $url = empty( $item['url'] ) ? '#' : $item['url'];
        $content_id = $item['pid'];
        $content_type = $item['content'];

        $has_child = 0;
        if ( array_key_exists( 'children', $item ) && !empty( $item['children'] ) ) {
            $has_child = 1;
        }

        $data = array(
            'label_menu' => $label,
            'url_menu' => $url,
            'content_id' => $content_id,
            'content_type' => $content_type,
            'parent_id' => $parent_id,
            'has_child' => $has_child
        );

        $this->menuModel->save( $data );