app/Models/Admin/Menumodel.php

SELECT `menu`.*, `pagetbl`.`pg_id`, `categorytbl`.`cat_id`, `posttbl`.`post_id`
FROM `menu`
LEFT JOIN `pagetbl` ON `pagetbl`.`pg_id` = `menu`.`content_id` AND `menu`.`content_type` = 1
LEFT JOIN `categorytbl` ON `categorytbl`.`cat_id` = `menu`.`content_id` AND `menu`.`content_type` = 3
LEFT JOIN `posttbl` ON `posttbl`.`post_id` = `menu`.`content_id` AND `menu`.`content_type` = 2
WHERE `menu`.`delete_status` = '0'
AND   (
   (
`menu`.`content_type` = '1'
AND `pagetbl`.`delete_status` = '0'
AND `pagetbl`.`page_status` = '1'
  )
OR    (
`menu`.`content_type` = '3'
AND `categorytbl`.`delete_status` = '0'
  )
OR    (
`menu`.`content_type` = '2'
AND `posttbl`.`delete_status` = '0'
AND `posttbl`.`status_id` = '1'
  )
OR    (
`menu`.`content_type` = '4'
  )
 )
---
    public function getAllmenu() {
        return $this
            ->select('menu.*, pagetbl.pg_id, categorytbl.cat_id, posttbl.post_id')
            ->join('pagetbl', 'pagetbl.pg_id = menu.content_id AND menu.content_type = 1', 'left')
            ->join('categorytbl', 'categorytbl.cat_id = menu.content_id AND menu.content_type = 3', 'left')
            ->join('posttbl', 'posttbl.post_id = menu.content_id AND menu.content_type = 2', 'left')
            ->where('menu.delete_status', '0')
            ->groupStart()
                ->groupStart()
                    ->where('menu.content_type', '1')
                    ->where('pagetbl.delete_status', '0')
                    ->where('pagetbl.page_status', '1')

                ->groupEnd()
                ->orGroupStart()
                    ->where('menu.content_type', '3')
                    ->where('categorytbl.delete_status', '0')

                ->groupEnd()
                ->orGroupStart()
                    ->where('menu.content_type', '2')
                    ->where('posttbl.delete_status', '0')
                    ->where('posttbl.status_id', '1')

                ->groupEnd()
                ->orGroupStart()
                    ->where('menu.content_type', '4')
                ->groupEnd()
            ->groupEnd()
            ->findAll();